/* end0.c — compiled with /Gs /Zi (stack probes disabled, debug info) */
#include "offsets.h"
#include "pointers.h"
#include "debug.h"
#include "util.h"
#include "end.h"

typedef unsigned int MenuItemFlags;

#define MENUITEM_TYPE_MASK    0x0007 // 0b0000000000000111
#define MENUITEM_SELECTABLE   0x0008 // 0b0000000000001000
#define MENUITEM_ENABLED      0x0100 // 0b0000000100000000
#define MENUITEM_HAS_SPRITE   0x0800 // 0b0000100000000000
#define MENUITEM_SPRITE_BLINK 0x1000 // 0b0001000000000000

typedef struct MenuItem {
    int  hitX1;          /* 0x00 */
    int  hitY1;          /* 0x02 */
    int  hitX2;          /* 0x04 */
    int  hitY2;          /* 0x06 */

    int  colorX1;        /* 0x08 */
    int  colorY1;        /* 0x0a */
    int  colorX2;        /* 0x0c */
    int  colorY2;        /* 0x0e */
    int  colorTableIdx;  /* 0x10 */
    int  colorPair;      /* 0x12 */

    char label[0x18];    /* 0x14 .. 0x2b */

    int  unk_2c;         /* 0x2c */
    int  state;          /* 0x2e */
    MenuItemFlags flags; /* 0x30 */
} MenuItem;

void main(void) {
    int p;
    int a;
    int b;
    uint16 far *d;
    int e;
    register int seg;

    (void)a; (void)e;

    FP_SEG(d) = SEG_LOWMEM;
    FP_OFF(d) = OFF_IACA_START;
    seg = *d;
    FP_SEG(commData) = seg;
    FP_OFF(commData) = 0;
    FP_SEG(gameData) = seg;
    FP_OFF(gameData) = COMM_GAMEDATA_OFFSET;
    setupOverlaySlots(((int far *)commData)[COMM_GFXOVL_ADDR_OFFSET / 2]);
    setupOverlaySlots(((int far *)commData)[COMM_MISCOVL_ADDR_OFFSET / 2]);
    misc_jump_5e_clearKeyFlags();
    clearKeybuf();
    hercFlag = ((char far *)commData)[COMM_SETUP_MONOCHROME_OFFSET];
    installCBreakHandler();
    initGraphics();
    if (((int far *)commData)[COMM_SETUP_USEJOY_OFFSET / 2] == 1) {
        copyJoystickData((char far *)commData + COMM_SETUP_JOYDATA_OFFSET);
    } else {
        joyAxisX = joyAxisY = JOY_CENTER;
    }
    loadWorldStrings();
    b = gfx_jump_31();
    p = gfx_jump_17_bufSize();
